To get it to work we commented the lines 90-92 in the file '~/terraform-provider-azurerm/azurerm/internal/services/subscription/subscription_resource.go' and used the locally compiled provider for testing.
```go
89 // Workload is not exposed in any way, so must be ignored if the resource is imported.
90 //DiffSuppressFunc: func(k, old, new string, d *schema.ResourceData) bool {
91 //      return old == ""
92 //},
```

After which the plan did not suppress the 'workload' parameter anymore and the subscription was created using the 'DevTest' workload.

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.components.azurerm_subscription.azureSubscription will be created
  + resource "azurerm_subscription" "azureSubscription" {
      + alias             = (known after apply)
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/<BILLING_ACCOUNT>/enrollmentAccounts/<ENROLLMENT_ACCOUNT>"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "testsub_local"
      + tags              = (known after apply)
      + tenant_id         = (known after apply)
      + workload          = "DevTest"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Could you please look into this, since we are unable to fully comprehend the purpose of this piece of code.
Was it only supposed to affect imported subscriptions (judged by the comment in line 89) or also the creation of a new subscription.
